{"keras_version": "2.0.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 150, 150, 3], "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_1", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "name": "conv2d_2", "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 64, "dilation_rate": [1, 1], "name": "conv2d_3", "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "activation": "linear", "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 64, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 1, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "sigmoid", "trainable": true}}]}