{"config": [{"config": {"trainable": true, "padding": "valid", "name": "conv2d_1", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "dtype": "float32", "dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 150, 150, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": "valid", "name": "conv2d_2", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": "valid", "name": "conv2d_3", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 64, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 1, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "2.0.0", "class_name": "Sequential", "backend": "tensorflow"}