{"keras_version": "2.0.3", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "batch_input_shape": [null, 150, 150, 3], "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "trainable": true, "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "filters": 32, "trainable": true, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "use_bias": true, "activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "trainable": true, "strides": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}}], "class_name": "Sequential"}