{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.0", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "dtype": "float32", "use_bias": true, "activation": "linear", "batch_input_shape": [null, 150, 150, 3], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "name": "conv2d_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32, "use_bias": true, "padding": "valid", "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "name": "conv2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 64, "use_bias": true, "padding": "valid", "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "name": "conv2d_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "units": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "units": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}}]}