{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.0", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "activation": "relu", "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"filters": 64, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "activation": "relu", "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 128, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "dense_1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 10, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "name": "dense_2"}}]}