{"keras_version": "2.0.0", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 32, "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_1", "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "batch_input_shape": [null, 150, 150, 3], "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 32, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 64, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_3", "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}}]}