{"keras_version": "2.0.3", "config": [{"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_1", "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 150, 150, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_2", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_3", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_constraint": null, "activation": "linear", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}