{"class_name": "Sequential", "keras_version": "2.0.0", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 150, 150, 3], "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "activation": "linear", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "activation": "linear", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "trainable": true, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "activation": "linear", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_2", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}]}